import { type SwiperProps } from 'swiper/react/swiper-react'

export const eventsSliderOptions: SwiperProps = {
	slidesPerView: 1,
	slidesPerGroup: 1,
	spaceBetween: 0,
	autoHeight: false,
	loop: true,
}

export const sliderItems = [
	{
		id: '1',
		title: 'Атмановские кулачки - 2025',
		desc: 'В этом году Атмановские кулачки состоятся в предпоследние выходные августа и будут приурочены к Успению Пресвятой Богородицы - престольному празднику села Атманов Угол. 22 августа — заезд участников, 23 августа — основной день игр, 24 августа — отъезд участников.',
		img: 'src/assets/img/lend-slider/kulachki-2025.jpg',
	},
	{
		id: '2',
		title: 'Ставим удар с 1648 года',
		desc: 'Атмановские кулачки — народное название праздничных кулачных боёв, которые проходят в Атмановом Углу со дня основания села в 1648 году. Кулачки приурочены к престольному празднику — Успению Пресвятой Богородицы.',
		img: 'src/assets/img/lend-slider/punch.jpg',
	},
	{
		id: '3',
		title: 'Мужская традиция',
		desc: 'Примерные кулачные бои с соблюдением народных правил проводились в селе Атманов Угол вплоть до середины 1980-х годов прошлого века. Эта мужская воинская традиция стала культурным ядром возрождённых игр.',
		img: 'src/assets/img/lend-slider/tradition.jpg',
	},
	{
		id: '4',
		title: 'Место русской силы',
		desc: 'Сегодня Атмановские кулачки — это титульные русские игры на которых проходят престижные годовые соревнования в дисциплинах русского этноспорта. Среди них соревнования по русской стенке, киле, борьбе за-вороток, рюхам и другим видам.',
		img: 'src/assets/img/lend-slider/russian_power.jpg',
	},
	{
		id: '5',
		title: 'Бой стенка-на-стенку',
		desc: 'Главным событием игр остаётся кулачный бой по народным правилам. В нём принимают участие все желающие. Участники и зрители кулачного боя знакомятся с боевыми традициями села Атманов Угол и на себе могут испробовать все его прелести.',
		img: 'src/assets/img/lend-slider/stenka-na-stenku.jpg',
	},
	{
		id: '6',
		title: 'Турнир по русской стенке',
		desc: '23 августа на Атмановских кулачках пройдёт Главный турнир года по русской стенке. В нём примут участие четыре лучшие ватаги страны, а кулачники-победители получат звание заправских бойцов России.',
		img: 'src/assets/img/lend-slider/russian_wall.jpg',
	},
	{
		id: '7',
		title: 'Боярское колесо',
		desc: 'Неотъемлемой частью Атмановских кулачек является праздничное гулянье, получившее в народе название «Боярское колесо». Здесь проходят состязания гармонистов, плясунов и частушечниц.',
		img: 'src/assets/img/lend-slider/koleso.jpg',
	},
	{
		id: '8',
		title: 'Исконные забавы',
		desc: 'Для гостей праздника на играх работают площадки исконных забав. Здесь все желающие от мала до велика могут поиграть в лапту, бабки, клёк, рюхи, килу, чижа, клюшки и множество других народных игр.',
		img: 'src/assets/img/lend-slider/zabavi.jpg',
	},
	{
		id: '9',
		title: 'Народные ремёсла',
		desc: 'На Атмановских кулачках широко представлены мастер-классы по традиционным домашним ремёслам и владению земледельческим инвентарём.',
		img: 'src/assets/img/lend-slider/remesla.jpg',
	},
	{
		id: '10',
		title: 'Атмановское подворье',
		desc: 'Рецепты приготовления блюд бережно хранят хозяйки Атманова Угла. На Атмановском подворье можно отведать щи из петуха — традиционное успенское блюдо, которое в день кулачек обязательно входило в меню мастеров кулачного схода.',
		img: 'src/assets/img/lend-slider/podvorie.jpg',
	},
	{
		id: '11',
		title: 'Атмановская ярмарка',
		desc: 'Традиционно на играх устраивается большая Атмановская ярмарка в которой принимают участие торговцы со всей страны.',
		img: 'src/assets/img/lend-slider/yarmarka.jpg',
	},
]
